---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceLoadContent.Dispose
source: html/13bdc1a5-d075-4afb-3f4b-1a3b89fb8371.htm
---
# Autodesk.Revit.DB.ExternalResourceLoadContent.Dispose Method

Releases all resources used by the ExternalResourceLoadContent

## Syntax (C#)
```csharp
public void Dispose()
```